tuya/tuyaopen-platform-t5ai/t5_os/cp/middleware/soc/bk7257/soc/sys_struct.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once

#ifdef __cplusplus
extern "C" {
#endif


typedef volatile union {
	struct {
		uint32_t deviceid                         : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_device_id_t;


typedef volatile union {
	struct {
		uint32_t versionid                        : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_version_id_t;


typedef volatile union {
	struct {
		uint32_t boot_mode                        :  1; /**<bit[0 : 0] */
		uint32_t reserved_bit_1_6                 :  6; /**<bit[1 : 6] */
		uint32_t jtag_core_sel                    :  2; /**<bit[7 : 8] */
		uint32_t flash_sel                        :  1; /**<bit[9 : 9] */
		uint32_t reserved_bit_10_31               : 22; /**<bit[10 : 31] */
	};
	uint32_t v;
} sys_cpu_storage_connect_op_select_t;

/*reg0x03*/
typedef volatile union {
	struct {
		uint32_t core0_halted                     :  1; /**<bit[0 : 0] */
		uint32_t core1_halted                     :  1; /**<bit[1 : 1] */
		uint32_t core2_halted                     :  1; /**<bit[2 : 2] */
		uint32_t reserved_bit_3_3                 :  1; /**<bit[3 : 3] */
		uint32_t cpu0_sw_reset                    :  1; /**<bit[4 : 4] */
		uint32_t cpu1_sw_reset                    :  1; /**<bit[5 : 5] */
		uint32_t cpu2_sw_reset                    :  1; /**<bit[6 : 6] */
		uint32_t reserved_bit_7_7                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_pwr_dw_state                :  1; /**<bit[8 : 8] */
		uint32_t cpu1_pwr_dw_state                :  1; /**<bit[9 : 9] */
		uint32_t cpu2_pwr_dw_state                :  1; /**<bit[10 : 10] */
		uint32_t reserved_bit_11_31               : 21; /**<bit[11 : 31] */
	};
	uint32_t v;
} sys_cpu_current_run_status_t;

/*reg0x04*/
typedef volatile union {
	struct {
		uint32_t cpu0_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu0_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t cpu0_int_mask                    :  1; /**<bit[2 : 2] */
		uint32_t cpu0_halt                        :  1; /**<bit[3 : 3] */
		uint32_t cpu0_speed                       :  1; /**<bit[4 : 4] */
		uint32_t cpu0_rxevt_sel                   :  1; /**<bit[5 : 5] */
		uint32_t reserved_6_7                     :  2; /**<bit[6 : 7] */
		uint32_t cpu0_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_halt_clk_op_t;

/*reg0x05*/
typedef volatile union {
	struct {
		uint32_t cpu1_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu1_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t cpu1_int_mask                    :  1; /**<bit[2 : 2] */
		uint32_t cpu1_halt                        :  1; /**<bit[3 : 3] */
		uint32_t cpu1_speed                       :  1; /**<bit[4 : 4] */
		uint32_t cpu1_rxevt_sel                   :  1; /**<bit[5 : 5] */
		uint32_t reserved_6_7                     :  2; /**<bit[6 : 7] */
		uint32_t cpu1_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_halt_clk_op_t;
/*reg0x06*/
typedef volatile union {
	struct {
		uint32_t cpu2_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu2_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t cpu2_int_mask                    :  1; /**<bit[2 : 2] */
		uint32_t cpu2_halt                        :  1; /**<bit[3 : 3] */
		uint32_t cpu2_speed                       :  1; /**<bit[4 : 4] */
		uint32_t cpu2_rxevt_sel                   :  1; /**<bit[5 : 5] */
		uint32_t reserved_6_7                     :  2; /**<bit[6 : 7] */
		uint32_t cpu2_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_cpu2_int_halt_clk_op_t;

/*reg0x07*/
typedef volatile union {
	struct {
		uint32_t reserved_0_31                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_reserved_reg0x7_t;

/*reg0x08*/
typedef volatile union {
	struct {
		uint32_t clkdiv_core                      :  4; /**<bit[0 : 3] */
		uint32_t cksel_core                       :  2; /**<bit[4 : 5] */
		uint32_t clkdiv_bus                       :  1; /**<bit[6 : 6] */
		uint32_t reserved_bit_7_7                 :  1; /**<bit[7 : 7] */
		uint32_t clkdiv_uart0                     :  2; /**<bit[8 : 9] */
		uint32_t clksel_uart0                     :  1; /**<bit[10 : 10] */
		uint32_t clkdiv_uart1                     :  2; /**<bit[11 : 12] */
		uint32_t cksel_uart1                      :  1; /**<bit[13 : 13] */
		uint32_t clkdiv_uart2                     :  2; /**<bit[14 : 15] */
		uint32_t cksel_uart2                      :  1; /**<bit[16 : 16] */
		uint32_t cksel_sadc                       :  1; /**<bit[17 : 17] */
		uint32_t cksel_pwm0                       :  1; /**<bit[18 : 18] */
		uint32_t cksel_pwm1                       :  1; /**<bit[19 : 19] */
		uint32_t cksel_tim0                       :  1; /**<bit[20 : 20] */
		uint32_t cksel_tim1                       :  1; /**<bit[21 : 21] */
		uint32_t cksel_tim2                       :  1; /**<bit[22 : 22] */
		uint32_t cksel_can                        :  1; /**<bit[23 : 23] */
		uint32_t cksel_i2s                        :  1; /**<bit[24 : 24] */
		uint32_t cksel_aud                        :  1; /**<bit[25 : 25] */
		uint32_t clkdiv_jpeg                      :  4; /**<bit[26 : 29] */
		uint32_t cksel_jpeg                       :  1; /**<bit[30 : 30] */
		uint32_t clkdiv_disp_l                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_clk_div_mode1_t;

/*reg0x09*/
typedef volatile union {
	struct {
		uint32_t clkdiv_disp_h                    :  3; /**<bit[0 : 2] */
		uint32_t cksel_disp                       :  1; /**<bit[3 : 3] */
		uint32_t ckdiv_psram                      :  1; /**<bit[4 : 4] */
		uint32_t cksel_psram                      :  1; /**<bit[5 : 5] */
		uint32_t ckdiv_qspi0                      :  4; /**<bit[6 : 9] */
		uint32_t cksel_qspi0                      :  1; /**<bit[10 : 10] */
		uint32_t cksel_i2s1                       :  1; /**<bit[11 : 11] */
		uint32_t cksel_i2s2                       :  1; /**<bit[12 : 12] */
		uint32_t reserved_13_13                   :  1; /**<bit[13 : 13] */
		uint32_t ckdiv_sdio                       :  3; /**<bit[14 : 16] */
		uint32_t cksel_sdio                       :  1; /**<bit[17 : 17] */
		uint32_t ckdiv_auxs                       :  4; /**<bit[18 : 21] */
		uint32_t cksel_auxs                       :  2; /**<bit[22 : 23] */
		uint32_t cksel_flash                      :  2; /**<bit[24 : 25] */
		uint32_t ckdiv_flash                      :  2; /**<bit[26 : 27] */
		uint32_t ckdiv_i2s0                       :  3; /**<bit[28 : 30] */
		uint32_t clkdiv_auxs                      :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_clk_div_mode2_t;

/*reg0x0a*/
typedef volatile union {
	struct {
		uint32_t ckdiv_26m                        :  2; /**<bit[0 : 1] */
		uint32_t ckdiv_wdt                        :  2; /**<bit[2 : 3] */
		uint32_t clksel_spi0                      :  1; /**<bit[4 : 4] */
		uint32_t clksel_spi1                      :  1; /**<bit[5 : 5] */
		uint32_t ckdiv_qspi1                      :  4; /**<bit[6 : 9] */
		uint32_t cksel_qspi1                      :  1; /**<bit[10 : 10] */
		uint32_t ckdiv_enet                       :  1; /**<bit[11 : 11] */
		uint32_t cksel_enet                       :  1; /**<bit[12 : 12] */
		uint32_t ckdiv_jpeg                       :  1; /**<bit[13 : 13] */
		uint32_t cksel_jpeg                       :  1; /**<bit[14 : 14] */
		uint32_t cksel_auxs_cis                   :  2; /**<bit[15 : 16] */
		uint32_t ckdiv_auxs_cis                   :  5; /**<bit[17 : 21] */
		uint32_t reserved_22_31                   : 10; /**<bit[22 : 31] */
	};
	uint32_t v;
} sys_cpu_26m_wdt_clk_div_t;

/*reg0x0b*/
typedef volatile union {
	struct {
		uint32_t anaspi_freq                      :  6; /**<bit[0 : 5] */
		uint32_t reserved_bit_6_31                : 26; /**<bit[6 : 31] */
	};
	uint32_t v;
} sys_cpu_anaspi_freq_t;

/*reg0x0c*/
typedef volatile union {
	struct {
		uint32_t i2c0_cken                        :  1; /**<bit[0 : 0] */
		uint32_t spi0_cken                        :  1; /**<bit[1 : 1] */
		uint32_t uart0_cken                       :  1; /**<bit[2 : 2] */
		uint32_t pwm0_cken                        :  1; /**<bit[3 : 3] */
		uint32_t tim0_cken                        :  1; /**<bit[4 : 4] */
		uint32_t sadc_cken                        :  1; /**<bit[5 : 5] */
		uint32_t irda_cken                        :  1; /**<bit[6 : 6] */
		uint32_t efuse_cken                       :  1; /**<bit[7 : 7] */
		uint32_t i2c1_cken                        :  1; /**<bit[8 : 8] */
		uint32_t spi1_cken                        :  1; /**<bit[9 : 9] */
		uint32_t uart1_cken                       :  1; /**<bit[10 : 10] */
		uint32_t uart2_cken                       :  1; /**<bit[11 : 11] */
		uint32_t pwm1_cken                        :  1; /**<bit[12 : 12] */
		uint32_t tim1_cken                        :  1; /**<bit[13 : 13] */
		uint32_t tim2_cken                        :  1; /**<bit[14 : 14] */
		uint32_t otp_cken                         :  1; /**<bit[15 : 15] */
		uint32_t i2s_cken                         :  1; /**<bit[16 : 16] */
		uint32_t usb_cken                         :  1; /**<bit[17 : 17] */
		uint32_t can_cken                         :  1; /**<bit[18 : 18] */
		uint32_t psram_cken                       :  1; /**<bit[19 : 19] */
		uint32_t qspi0_cken                       :  1; /**<bit[20 : 20] */
		uint32_t qspi1_cken                       :  1; /**<bit[21 : 21] */
		uint32_t sdio_cken                        :  1; /**<bit[22 : 22] */
		uint32_t auxs_cken                        :  1; /**<bit[23 : 23] */
		uint32_t btdm_cken                        :  1; /**<bit[24 : 24] */
		uint32_t xvr_cken                         :  1; /**<bit[25 : 25] */
		uint32_t mac_cken                         :  1; /**<bit[26 : 26] */
		uint32_t phy_cken                         :  1; /**<bit[27 : 27] */
		uint32_t jpeg_cken                        :  1; /**<bit[28 : 28] */
		uint32_t disp_cken                        :  1; /**<bit[29 : 29] */
		uint32_t aud_cken                         :  1; /**<bit[30 : 30] */
		uint32_t wdt_cken                         :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_clk_enable_t;

