tuya/tuyaopen-platform-t5ai/t5_os/cp/middleware/soc/bk7257/soc/sys_struct.h
/*reg0x0d*/
typedef volatile union {
	struct {
		uint32_t h264_cken                        :  1; /**<bit[0 : 0] */
		uint32_t i2s1_cken                        :  1; /**<bit[1 : 1] */
		uint32_t i2s2_cken                        :  1; /**<bit[2 : 2] */
		uint32_t yuv_cken                         :  1; /**<bit[3 : 3] */
		uint32_t slcd_cken                        :  1; /**<bit[4 : 4] */
		uint32_t lin_cken                         :  1; /**<bit[5 : 5] */
		uint32_t scr_cken                         :  1; /**<bit[6 : 6] */
		uint32_t enet_cken                        :  1; /**<bit[7 : 7] */
		uint32_t jpeg_cken                        :  1; /**<bit[8 : 8] */
		uint32_t cis_auxs_cken                    :  1; /**<bit[9 : 9] */
		uint32_t reserved_10_31                   : 22; /**<bit[10 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0xd_t;

/*reg0x0e, sd:shutdown*/
typedef volatile union {
	struct {
		uint32_t uart1_sd                         :  1; /**<bit[0 : 0] */
		uint32_t uart2_sd                         :  1; /**<bit[1 : 1] */
		uint32_t spi1_sd                          :  1; /**<bit[2 : 2] */
		uint32_t sdio_sd                          :  1; /**<bit[3 : 3] */
		uint32_t usb_sd                           :  1; /**<bit[4 : 4] */
		uint32_t can_sd                           :  1; /**<bit[5 : 5] */
		uint32_t qspi0_sd                         :  1; /**<bit[6 : 6] */
		uint32_t qspi1_sd                         :  1; /**<bit[7 : 7] */
		uint32_t pram_sd                          :  1; /**<bit[8 : 8] */
		uint32_t fft_sd                           :  1; /**<bit[9 : 9] */
		uint32_t abc_sd                           :  1; /**<bit[10 : 10] */
		uint32_t aud_sd                           :  1; /**<bit[11 : 11] */
		uint32_t i2s0_sd                          :  1; /**<bit[12 : 12] */
		uint32_t i2s1_sd                          :  1; /**<bit[13 : 13] */
		uint32_t i2s2_sd                          :  1; /**<bit[14 : 14] */
		uint32_t jpge_sd                          :  1; /**<bit[15 : 15] */
		uint32_t yuv_sd                           :  1; /**<bit[16 : 16] */
		uint32_t jpgd_sd                          :  1; /**<bit[17 : 17] */
		uint32_t disp_sd                          :  1; /**<bit[18 : 18] */
		uint32_t dmad_sd                          :  1; /**<bit[19 : 19] */
		uint32_t h26f_sd                          :  1; /**<bit[20 : 20] */
		uint32_t mac_sd                           :  1; /**<bit[21 : 21] */
		uint32_t phy_sd                           :  1; /**<bit[22 : 22] */
		uint32_t xvr_sd                           :  1; /**<bit[23 : 23] */
		uint32_t irda_sd                          :  1; /**<bit[24 : 24] */
		uint32_t la_sd                            :  1; /**<bit[25 : 25] */
		uint32_t flsh_sd                          :  1; /**<bit[26 : 26] */
		uint32_t uart_sd                          :  1; /**<bit[27 : 27] */
		uint32_t spi0_sd                          :  1; /**<bit[28 : 28] */
		uint32_t enc_sd                           :  1; /**<bit[29 : 29] */
		uint32_t dma0_sd                          :  1; /**<bit[30 : 30] */
		uint32_t dma1_sd                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl1_t;

/*reg0x0f*/
typedef volatile union {
	struct {
		uint32_t uart1_ds                         :  1; /**<bit[0 : 0] */
		uint32_t uart2_ds                         :  1; /**<bit[1 : 1] */
		uint32_t spi1_ds                          :  1; /**<bit[2 : 2] */
		uint32_t sdio_ds                          :  1; /**<bit[3 : 3] */
		uint32_t usb_ds                           :  1; /**<bit[4 : 4] */
		uint32_t can_ds                           :  1; /**<bit[5 : 5] */
		uint32_t qspi0_ds                         :  1; /**<bit[6 : 6] */
		uint32_t qspi1_ds                         :  1; /**<bit[7 : 7] */
		uint32_t pram_ds                          :  1; /**<bit[8 : 8] */
		uint32_t fft_ds                           :  1; /**<bit[9 : 9] */
		uint32_t abc_ds                           :  1; /**<bit[10 : 10] */
		uint32_t aud_ds                           :  1; /**<bit[11 : 11] */
		uint32_t i2s0_ds                          :  1; /**<bit[12 : 12] */
		uint32_t i2s1_ds                          :  1; /**<bit[13 : 13] */
		uint32_t i2s2_ds                          :  1; /**<bit[14 : 14] */
		uint32_t jpge_ds                          :  1; /**<bit[15 : 15] */
		uint32_t yuv_ds                           :  1; /**<bit[16 : 16] */
		uint32_t jpgd_ds                          :  1; /**<bit[17 : 17] */
		uint32_t disp_ds                          :  1; /**<bit[18 : 18] */
		uint32_t dmad_ds                          :  1; /**<bit[19 : 19] */
		uint32_t h26f_ds                          :  1; /**<bit[20 : 20] */
		uint32_t mac_ds                           :  1; /**<bit[21 : 21] */
		uint32_t phy_ds                           :  1; /**<bit[22 : 22] */
		uint32_t xvr_ds                           :  1; /**<bit[23 : 23] */
		uint32_t irda_ds                          :  1; /**<bit[24 : 24] */
		uint32_t la_ds                            :  1; /**<bit[25 : 25] */
		uint32_t flsh_ds                          :  1; /**<bit[26 : 26] */
		uint32_t uart_ds                          :  1; /**<bit[27 : 27] */
		uint32_t spi0_ds                          :  1; /**<bit[28 : 28] */
		uint32_t enc_ds                           :  1; /**<bit[29 : 29] */
		uint32_t dma0_ds                          :  1; /**<bit[30 : 30] */
		uint32_t dma1_ds                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl2_t;


typedef volatile union {
	struct {
		uint32_t pwd_mem1                         :  1; /**<bit[0 : 0] */
		uint32_t pwd_mem2                         :  1; /**<bit[1 : 1] */
		uint32_t pwd_mem3                         :  1; /**<bit[2 : 2] */
		uint32_t pwd_encp                         :  1; /**<bit[3 : 3] */
		uint32_t pwd_bakp                         :  1; /**<bit[4 : 4] */
		uint32_t pwd_ahbp                         :  1; /**<bit[5 : 5] */
		uint32_t pwd_audp                         :  1; /**<bit[6 : 6] */
		uint32_t pwd_vidp                         :  1; /**<bit[7 : 7] */
		uint32_t pwd_btsp                         :  1; /**<bit[8 : 8] */
		uint32_t pwd_wifp_mac                     :  1; /**<bit[9 : 9] */
		uint32_t pwd_wifp_phy                     :  1; /**<bit[10 : 10] */
		uint32_t pwd_mem0                         :  1; /**<bit[11 : 11] */
		uint32_t pwd_mem4                         :  1; /**<bit[12 : 12] */
		uint32_t pwd_ofdm                         :  1; /**<bit[13 : 13] */
		uint32_t pwd_mem5                         :  1; /**<bit[14 : 14] */
		uint32_t rom_pgen                         :  1; /**<bit[15 : 15] */
		uint32_t sleep_en_need_flash_idle         :  1; /**<bit[16 : 16] */
		uint32_t sleep_en_need_cpu1_wfi           :  1; /**<bit[17 : 17] */
		uint32_t sleep_en_need_cpu0_wfi           :  1; /**<bit[18 : 18] */
		uint32_t sleep_en_global                  :  1; /**<bit[19 : 19] */
		uint32_t sleep_bus_idle_bypass            :  1; /**<bit[20 : 20] */
		uint32_t sleep_en_need_cpu2_wfi           :  1; /**<bit[21 : 21] */
		uint32_t bts_soft_wakeup_req              :  1; /**<bit[22 : 22] */
		uint32_t rom_rd_disable                   :  1; /**<bit[23 : 23] */
		uint32_t otp_rd_disable                   :  1; /**<bit[24 : 24] */
		uint32_t tcm0_pgen                        :  1; /**<bit[25 : 25] */
		uint32_t cpu0_subpwdm_en                  :  1; /**<bit[26 : 26] */
		uint32_t cpu2_ticktimer_32k_enable        :  1; /**<bit[27 : 27] */
		uint32_t share_mem_clkgating_disable      :  1; /**<bit[28 : 28] */
		uint32_t cpu0_ticktimer_32k_enable        :  1; /**<bit[29 : 29] */
		uint32_t cpu1_ticktimer_32k_enable        :  1; /**<bit[30 : 30] */
		uint32_t busmatrix_busy                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_power_sleep_wakeup_t;


typedef volatile union {
	struct {
		uint32_t cpu0_cache_ret_en                :  1; /**<bit[0 : 0] */
		uint32_t cpu0_cache_sleeppwd_en           :  1; /**<bit[1 : 1] */
		uint32_t cpu0_fpu_sleeppwd_en             :  1; /**<bit[2 : 2] */
		uint32_t reserved_3_6                     :  4; /**<bit[3 : 6] */
		uint32_t sys2flsh_2wire                   :  1; /**<bit[7 : 7] */
		uint32_t reserved_8_31                    : 14; /**<bit[8 : 31]*/
	};
	uint32_t v;
} sys_cpu0_lv_sleep_cfg_t;


typedef volatile union {
	struct {
		uint32_t ram0_mem_ds_deep_sleep           :  1; /**<bit[0 : 0] */
		uint32_t ram1_deep_sleep                  :  1; /**<bit[1 : 1] */
		uint32_t ram2_deep_sleep                  :  1; /**<bit[2 : 2] */
		uint32_t ram3_deep_sleep                  :  1; /**<bit[3 : 3] */
		uint32_t ram4_deep_sleep                  :  1; /**<bit[4 : 4] */
		uint32_t cpu0_icache_itag_deep_sleep      :  1; /**<bit[5 : 5] */
		uint32_t cpu0_dcache_dtag_deep_sleep      :  1; /**<bit[6 : 6] */
		uint32_t cpu1_icache_itag_deep_sleep      :  1; /**<bit[7 : 7] */
		uint32_t cpu1_dcache_dtag_deep_sleep      :  1; /**<bit[8 : 8] */
		uint32_t cpu0_itcm_deep_sleep             :  1; /**<bit[9 : 9] */
		uint32_t cpu0_dtcm_deep_sleep             :  1; /**<bit[10 : 10] */
		uint32_t cpu1_itcm_deep_sleep             :  1; /**<bit[11 : 11] */
		uint32_t cpu1_dtcm_deep_sleep             :  1; /**<bit[12 : 12] */
		uint32_t rott_deep_sleep                  :  1; /**<bit[13 : 13] */
		uint32_t scal0_deep_sleep                 :  1; /**<bit[14 : 14] */
		uint32_t scal1_deep_sleep                 :  1; /**<bit[15 : 15] */
		uint32_t ram0_mem_sd_shutdown             :  1; /**<bit[16 : 16] */
		uint32_t ram1_shutdown                    :  1; /**<bit[17 : 17] */
		uint32_t ram2_shutdown                    :  1; /**<bit[18 : 18] */
		uint32_t ram3_shutdown                    :  1; /**<bit[19 : 19] */
		uint32_t ram4_shutdown                    :  1; /**<bit[20 : 20] */
		uint32_t cpu0_icache_itag_shutdown        :  1; /**<bit[21 : 21] */
		uint32_t cpu0_dcache_dtag_shutdown        :  1; /**<bit[22 : 22] */
		uint32_t cpu1_icache_itag_shutdown        :  1; /**<bit[23 : 23] */
		uint32_t cpu1_dcache_dtag_shutdown        :  1; /**<bit[24 : 24] */
		uint32_t cpu0_itcm_shutdown               :  1; /**<bit[25 : 25] */
		uint32_t cpu0_dtcm_shutdown               :  1; /**<bit[26 : 26] */
		uint32_t cpu1_itcm_shutdown               :  1; /**<bit[27 : 27] */
		uint32_t cpu1_dtcm_shutdown               :  1; /**<bit[28 : 28] */
		uint32_t rott_shutdown                    :  1; /**<bit[29 : 29] */
		uint32_t scal0_shutdown                   :  1; /**<bit[30 : 30] */
		uint32_t scal1_shutdown                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl3_t;


typedef volatile union {
	struct {
		uint32_t cpu0_dma0_nsec_intr_en           :  1; /**<bit[0 : 0] */
		uint32_t cpu0_encp_sec_intr_en            :  1; /**<bit[1 : 1] */
		uint32_t cpu0_encp_nsec_intr_en           :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer0_int_en               :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu0_sdio_int_en                 :  1; /**<bit[10 : 10] */
		uint32_t cpu0_gdma_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_timer1_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_i2c1_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_uart2_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_spi1_int_en                 :  1; /**<bit[17 : 17] */
		uint32_t cpu0_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_usb_int_en                  :  1; /**<bit[19 : 19] */
		uint32_t cpu0_qspi0_int_en                :  1; /**<bit[20 : 20] */
		uint32_t cpu0_fft_int_en                  :  1; /**<bit[21 : 21] */
		uint32_t cpu0_sbc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_jpegenc_int_en              :  1; /**<bit[25 : 25] */
		uint32_t cpu0_jpegdec_int_en              :  1; /**<bit[26 : 26] */
		uint32_t cpu0_lcd_display_int_en          :  1; /**<bit[27 : 27] */
		uint32_t cpu0_dma2d_int_en                :  1; /**<bit[28 : 28] */
		uint32_t cpu0_wifi_int_phy_mpb_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu0_wifi_int_phy_riu_en         :  1; /**<bit[30 : 30] */
		uint32_t cpu0_wifi_mac_int_tx_rx_timer_en :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu0_wifi_mac_int_tx_rx_misc_en  :  1; /**<bit[0 : 0] */
		uint32_t cpu0_wifi_mac_int_rx_trigger_en  :  1; /**<bit[1 : 1] */
		uint32_t cpu0_wifi_mac_int_tx_trigger_en  :  1; /**<bit[2 : 2] */
		uint32_t cpu0_wifi_mac_int_prot_trigger_en :  1; /**<bit[3 : 3] */
		uint32_t cpu0_wifi_mac_int_gen_en         :  1; /**<bit[4 : 4] */
		uint32_t cpu0_wifi_hsu_irq_en             :  1; /**<bit[5 : 5] */
		uint32_t cpu0_wifi_int_mac_wakeup_en      :  1; /**<bit[6 : 6] */
		uint32_t cpu0_dm_irq_en                   :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_en                  :  1; /**<bit[8 : 8] */
		uint32_t cpu0_bt_irq_en                   :  1; /**<bit[9 : 9] */
		uint32_t cpu0_qspi1_int_en                :  1; /**<bit[10 : 10] */
		uint32_t cpu0_pwm1_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_i2s1_int_en                 :  1; /**<bit[12 : 12] */
		uint32_t cpu0_i2s2_int_en                 :  1; /**<bit[13 : 13] */
		uint32_t cpu0_h264_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_sdmadc_int_en               :  1; /**<bit[15 : 15] */
		uint32_t cpu0_mbox0_int_en                :  1; /**<bit[16 : 16] */
		#define cpu0_eth_int_en  cpu0_mbox0_int_en
		uint32_t cpu0_mbox1_int_en                :  1; /**<bit[17 : 17] */
		uint32_t cpu0_bmc64_int_en                :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpll_unlock_int_en          :  1; /**<bit[19 : 19] */
		uint32_t cpu0_touched_int_en              :  1; /**<bit[20 : 20] */
		uint32_t cpu0_usbplug_int_en              :  1; /**<bit[21 : 21] */
		uint32_t cpu0_rtc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_int_en                 :  1; /**<bit[23 : 23] */
		uint32_t cpu0_dma1_sec_int_en             :  1; /**<bit[24 : 24] */
		uint32_t cpu0_dma1_nsec_int_en            :  1; /**<bit[25 : 25] */
		uint32_t cpu0_yuvb_int_en                 :  1; /**<bit[26 : 26] */
		uint32_t cpu0_rott_int_en                 :  1; /**<bit[27 : 27] */
		uint32_t cpu0_7816_int_en                 :  1; /**<bit[28 : 28] */
		uint32_t cpu0_lin_int_en                  :  1; /**<bit[29 : 29] */
		uint32_t cpu0_scal1_int_en                :  1; /**<bit[30 : 30] */
		uint32_t cpu0_mailbox_int_en              :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_32_63_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_dma0_nsec_intr_en           :  1; /**<bit[0 : 0] */
		uint32_t cpu1_encp_sec_intr_en            :  1; /**<bit[1 : 1] */
		uint32_t cpu1_encp_nsec_intr_en           :  1; /**<bit[2 : 2] */
		uint32_t cpu1_timer0_int_en               :  1; /**<bit[3 : 3] */
		uint32_t cpu1_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu1_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu1_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu1_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu1_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu1_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu1_sdio_int_en                 :  1; /**<bit[10 : 10] */
		uint32_t cpu1_gdma_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu1_timer1_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu1_i2c1_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu1_uart2_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_spi1_int_en                 :  1; /**<bit[17 : 17] */
		uint32_t cpu1_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu1_usb_int_en                  :  1; /**<bit[19 : 19] */
		uint32_t cpu1_qspi0_int_en                :  1; /**<bit[20 : 20] */
		uint32_t cpu1_fft_int_en                  :  1; /**<bit[21 : 21] */
		uint32_t cpu1_sbc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu1_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu1_jpegenc_int_en              :  1; /**<bit[25 : 25] */
		uint32_t cpu1_jpegdec_int_en              :  1; /**<bit[26 : 26] */
		uint32_t cpu1_lcd_display_int_en          :  1; /**<bit[27 : 27] */
		uint32_t cpu1_dma2d_int_en                :  1; /**<bit[28 : 28] */
		uint32_t cpu1_wifi_int_phy_mpb_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu1_wifi_int_phy_riu_en         :  1; /**<bit[30 : 30] */
		uint32_t cpu1_wifi_mac_int_tx_rx_timer_en :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_wifi_mac_int_tx_rx_misc_en  :  1; /**<bit[0 : 0] */
		uint32_t cpu1_wifi_mac_int_rx_trigger_en  :  1; /**<bit[1 : 1] */
		uint32_t cpu1_wifi_mac_int_tx_trigger_en  :  1; /**<bit[2 : 2] */
		uint32_t cpu1_wifi_mac_int_prot_trigger_en :  1; /**<bit[3 : 3] */
		uint32_t cpu1_wifi_mac_int_gen_en         :  1; /**<bit[4 : 4] */
		uint32_t cpu1_wifi_hsu_irq_en             :  1; /**<bit[5 : 5] */
		uint32_t cpu1_wifi_int_mac_wakeup_en      :  1; /**<bit[6 : 6] */
		uint32_t cpu1_dm_irq_en                   :  1; /**<bit[7 : 7] */
		uint32_t cpu1_ble_irq_en                  :  1; /**<bit[8 : 8] */
		uint32_t cpu1_bt_irq_en                   :  1; /**<bit[9 : 9] */
		uint32_t cpu1_qspi1_int_en                :  1; /**<bit[10 : 10] */
		uint32_t cpu1_pwm1_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_i2s1_int_en                 :  1; /**<bit[12 : 12] */
		uint32_t cpu1_i2s2_int_en                 :  1; /**<bit[13 : 13] */
		uint32_t cpu1_h264_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_sdmadc_int_en               :  1; /**<bit[15 : 15] */
		uint32_t cpu1_eth_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_mbox1_int_en                :  1; /**<bit[17 : 17] */
		uint32_t cpu1_bmc64_int_en                :  1; /**<bit[18 : 18] */
		uint32_t cpu1_dpll_unlock_int_en          :  1; /**<bit[19 : 19] */
		uint32_t cpu1_touched_int_en              :  1; /**<bit[20 : 20] */
		uint32_t cpu1_usbplug_int_en              :  1; /**<bit[21 : 21] */
		uint32_t cpu1_rtc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_gpio_int_en                 :  1; /**<bit[23 : 23] */
		uint32_t cpu1_dma1_sec_int_en             :  1; /**<bit[24 : 24] */
		uint32_t cpu1_dma1_nsec_int_en            :  1; /**<bit[25 : 25] */
		uint32_t cpu1_yuvb_int_en                 :  1; /**<bit[26 : 26] */
		uint32_t cpu1_rott_int_en                 :  1; /**<bit[27 : 27] */
		uint32_t cpu1_7816_int_en                 :  1; /**<bit[28 : 28] */
		uint32_t cpu1_lin_int_en                  :  1; /**<bit[29 : 29] */
		uint32_t cpu1_scal1_int_en                :  1; /**<bit[30 : 30] */
		uint32_t cpu1_mailbox_int_en              :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_32_63_en_t;



typedef volatile union {
	struct {
		uint32_t cpu2_dma0_nsec_intr_en           :  1; /**<bit[0 : 0] */
		uint32_t cpu2_encp_sec_intr_en            :  1; /**<bit[1 : 1] */
		uint32_t cpu2_encp_nsec_intr_en           :  1; /**<bit[2 : 2] */
		uint32_t cpu2_timer0_int_en               :  1; /**<bit[3 : 3] */
		uint32_t cpu2_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu2_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu2_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu2_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu2_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu2_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu2_sdio_int_en                 :  1; /**<bit[10 : 10] */
		uint32_t cpu2_gdma_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu2_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu2_timer1_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu2_i2c1_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu2_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu2_uart2_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu2_spi1_int_en                 :  1; /**<bit[17 : 17] */
		uint32_t cpu2_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu2_usb_int_en                  :  1; /**<bit[19 : 19] */
		uint32_t cpu2_qspi0_int_en                :  1; /**<bit[20 : 20] */
		uint32_t cpu2_fft_int_en                  :  1; /**<bit[21 : 21] */
		uint32_t cpu2_sbc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu2_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu2_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu2_jpegenc_int_en              :  1; /**<bit[25 : 25] */
		uint32_t cpu2_jpegdec_int_en              :  1; /**<bit[26 : 26] */
		uint32_t cpu2_lcd_display_int_en          :  1; /**<bit[27 : 27] */
		uint32_t cpu2_dma2d_int_en                :  1; /**<bit[28 : 28] */
		uint32_t cpu2_wifi_int_phy_mpb_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu2_wifi_int_phy_riu_en         :  1; /**<bit[30 : 30] */
		uint32_t cpu2_wifi_mac_int_tx_rx_timer_en :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu2_int_0_31_en_t;


