tuya/tuyaopen-platform-t5ai/t5_os/cp/middleware/soc/bk7257/soc/sys_struct.h
typedef volatile union {
	struct {
		uint32_t nc_0_0                           :  1; /**<bit[0 : 0] */
		uint32_t en_xtall                         :  1; /**<bit[1 : 1] */
		uint32_t en_dco                           :  1; /**<bit[2 : 2] */
		uint32_t nc_3_3                           :  1; /**<bit[3 : 3] */
		uint32_t en_temp                          :  1; /**<bit[4 : 4] */
		uint32_t en_dpll                          :  1; /**<bit[5 : 5] */
		uint32_t en_cb                            :  1; /**<bit[6 : 6] */
		uint32_t en_lcd                           :  1; /**<bit[7 : 7] */
		uint32_t nc_8_9                           :  2; /**<bit[8 : 9] */
		uint32_t adc_div                          :  2; /**<bit[10 : 11] */
		uint32_t rosc_disable                     :  1; /**<bit[12 : 12] */
		uint32_t pwdaudpll                        :  1; /**<bit[13 : 13] */
		uint32_t pwd_rosc_spi                     :  1; /**<bit[14 : 14] */
		uint32_t nc_15_15                         :  1; /**<bit[15 : 15] */
		uint32_t itune_xtall                      :  4; /**<bit[16 : 19] */
		uint32_t xtall_ten                        :  1; /**<bit[20 : 20] */
		uint32_t rosc_tsten                       :  1; /**<bit[21 : 21] */
		uint32_t bcal_start                       :  1; /**<bit[22 : 22] */
		uint32_t bcal_en                          :  1; /**<bit[23 : 23] */
		uint32_t bcal_sel                         :  3; /**<bit[24 : 26] */
		uint32_t vbias                            :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_ana_reg5_t;


typedef volatile union {
	struct {
		uint32_t calib_interval                   : 10; /**<bit[0 : 9] */
		uint32_t modify_interval                  :  6; /**<bit[10 : 15] */
		uint32_t xtal_wakeup_time                 :  4; /**<bit[16 : 19] */
		uint32_t spi_trig                         :  1; /**<bit[20 : 20] */
		uint32_t modifi_auto                      :  1; /**<bit[21 : 21] */
		uint32_t calib_auto                       :  1; /**<bit[22 : 22] */
		uint32_t cal_mode                         :  1; /**<bit[23 : 23] */
		uint32_t manu_ena                         :  1; /**<bit[24 : 24] */
		uint32_t manu_cin                         :  7; /**<bit[25 : 31] */
	};
	uint32_t v;
} sys_ana_reg6_t;


typedef volatile union {
	struct {
		uint32_t port_enablel                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg7_t;


typedef volatile union {
	struct {
		uint32_t ioldo_lp                         :  1; /**<bit[0 : 0] */
		uint32_t coreldo_hp                       :  1; /**<bit[1 : 1] */
		uint32_t dldohp                           :  1; /**<bit[2 : 2] */
		uint32_t t_vanaldosel                     :  3; /**<bit[3 : 5] */
		uint32_t r_vanaldosel                     :  3; /**<bit[6 : 8] */
		uint32_t en_trsw                          :  1; /**<bit[9 : 9] */
		uint32_t aldohp                           :  1; /**<bit[10 : 10] */
		uint32_t anacurlim                        :  1; /**<bit[11 : 11] */
		uint32_t violdosel                        :  3; /**<bit[12 : 14] */
		uint32_t iocurlim                         :  1; /**<bit[15 : 15] */
		uint32_t valoldosel                       :  3; /**<bit[16 : 18] */
		uint32_t alopowsel                        :  1; /**<bit[19 : 19] */
		uint32_t en_fast_aloldo                   :  1; /**<bit[20 : 20] */
		uint32_t aloldohp                         :  1; /**<bit[21 : 21] */
		uint32_t bgcal                            :  6; /**<bit[22 : 27] */
		uint32_t vbgcalmode                       :  1; /**<bit[28 : 28] */
		uint32_t vbgcalstart                      :  1; /**<bit[29 : 29] */
		uint32_t pwd_bgcal                        :  1; /**<bit[30 : 30] */
		uint32_t spi_envbg                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg8_t;


typedef volatile union {
	struct {
		uint32_t wkgpiosel1                       :  4; /**<bit[0 : 3] */
		uint32_t rst_wks1v                        :  1; /**<bit[4 : 4] */
		uint32_t wkgpiosel2                       :  4; /**<bit[5 : 8] */
		uint32_t spi_latch1v                      :  1; /**<bit[9 : 9] */
		uint32_t digcurlim                        :  1; /**<bit[10 : 10] */
		uint32_t pupres_enb1v                     :  1; /**<bit[11 : 11] */
		uint32_t pdnres_en1v                      :  1; /**<bit[12 : 12] */
		uint32_t d_veasel1v                       :  2; /**<bit[13 : 14] */
		uint32_t ensfsdd                          :  1; /**<bit[15 : 15] */
		uint32_t vcorehsel                        :  4; /**<bit[16 : 19] */
		uint32_t vcorelsel                        :  3; /**<bit[20 : 22] */
		uint32_t vlden                            :  1; /**<bit[23 : 23] */
		uint32_t en_fast_coreldo                  :  1; /**<bit[24 : 24] */
		uint32_t pwdcoreldo                       :  1; /**<bit[25 : 25] */
		uint32_t vdighsel                         :  3; /**<bit[26 : 28] */
		uint32_t vdigsel                          :  2; /**<bit[29 : 30] */
		uint32_t vdd12lden                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg9_t;


typedef volatile union {
	struct {
		uint32_t nc_0_2                           :  3; /**<bit[0 : 2] */
		uint32_t vbspbuflp1v                      :  1; /**<bit[3 : 3] */
		uint32_t azcdcnt_manu                     :  3; /**<bit[4 : 6] */
		uint32_t timer_sel                        :  4; /**<bit[7 : 10] */
		uint32_t vddgpio_sel                      :  1; /**<bit[11 : 11] */
		uint32_t en_usbvcc1v8                     :  1; /**<bit[12 : 12] */
		uint32_t en_usbvcc3v                      :  1; /**<bit[13 : 13] */
		uint32_t nc_14_14                         :  1; /**<bit[14 : 14] */
		uint32_t spi_timerwken                    :  1; /**<bit[15 : 15] */
		uint32_t spi_byp32pwd                     :  1; /**<bit[16 : 16] */
		uint32_t sd                               :  1; /**<bit[17 : 17] */
		uint32_t nc_18_18                         :  1; /**<bit[18 : 18] */
		uint32_t iobyapssen                       :  1; /**<bit[19 : 19] */
		uint32_t ckfs                             :  2; /**<bit[20 : 21] */
		uint32_t ckintsel                         :  1; /**<bit[22 : 22] */
		uint32_t osccaltrig                       :  1; /**<bit[23 : 23] */
		uint32_t mroscsel                         :  1; /**<bit[24 : 24] */
		uint32_t mrosci_cal                       :  3; /**<bit[25 : 27] */
		uint32_t mrosccap_cal                     :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_ana_reg10_t;


typedef volatile union {
	struct {
		uint32_t sfsr                             :  4; /**<bit[0 : 3] */
		uint32_t ensfsaa                          :  1; /**<bit[4 : 4] */
		uint32_t apfms                            :  5; /**<bit[5 : 9] */
		uint32_t atmpo_sel                        :  2; /**<bit[10 : 11] */
		uint32_t ampoen                           :  1; /**<bit[12 : 12] */
		uint32_t enpowa                           :  1; /**<bit[13 : 13] */
		uint32_t avea_sel                         :  2; /**<bit[14 : 15] */
		uint32_t aforcepfm                        :  1; /**<bit[16 : 16] */
		uint32_t acls                             :  3; /**<bit[17 : 19] */
		uint32_t aswrsten                         :  1; /**<bit[20 : 20] */
		uint32_t aripc                            :  3; /**<bit[21 : 23] */
		uint32_t arampc                           :  4; /**<bit[24 : 27] */
		uint32_t arampcen                         :  1; /**<bit[28 : 28] */
		uint32_t aenburst                         :  1; /**<bit[29 : 29] */
		uint32_t apfmen                           :  1; /**<bit[30 : 30] */
		uint32_t aldosel                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg11_t;


typedef volatile union {
	struct {
		uint32_t buckd_softst                     :  4; /**<bit[0 : 3] */
		uint32_t dzcdcnt_manu                     :  3; /**<bit[4 : 6] */
		uint32_t clk_sel                          :  1; /**<bit[7 : 7] */
		uint32_t dpfms                            :  5; /**<bit[8 : 12] */
		uint32_t dtmpo_sel                        :  2; /**<bit[13 : 14] */
		uint32_t dmpoen                           :  1; /**<bit[15 : 15] */
		uint32_t dforcepfm                        :  1; /**<bit[16 : 16] */
		uint32_t dcls                             :  3; /**<bit[17 : 19] */
		uint32_t dswrsten                         :  1; /**<bit[20 : 20] */
		uint32_t dripc                            :  3; /**<bit[21 : 23] */
		uint32_t drampc                           :  4; /**<bit[24 : 27] */
		uint32_t drampcen                         :  1; /**<bit[28 : 28] */
		uint32_t denburst                         :  1; /**<bit[29 : 29] */
		uint32_t dpfmen                           :  1; /**<bit[30 : 30] */
		uint32_t dldosel                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg12_t;


typedef volatile union {
	struct {
		uint32_t pwdovp1v                         :  1; /**<bit[0 : 0] */
		uint32_t asoft_stc                        :  4; /**<bit[1 : 4] */
		uint32_t dldo_czsel                       :  3; /**<bit[5 : 7] */
		uint32_t dldo_rzsel                       :  2; /**<bit[8 : 9] */
		uint32_t nc_10_11                         :  2; /**<bit[10 : 11] */
		uint32_t vtrxspisel                       :  2; /**<bit[12 : 13] */
		uint32_t nc_14_19                         :  6; /**<bit[14 : 19] */
		uint32_t aldo_czsel                       :  3; /**<bit[20 : 22] */
		uint32_t aldo_rzsel                       :  2; /**<bit[23 : 24] */
		uint32_t nc_25_27                         :  3; /**<bit[25 : 27] */
		uint32_t psldo_swb                        :  1; /**<bit[28 : 28] */
		uint32_t vpsramsel                        :  2; /**<bit[29 : 30] */
		uint32_t enpsram                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg13_t;


typedef volatile union {
	struct {
		uint32_t reg                              : 10; /**<bit[0 : 9] */
		uint32_t en_adcmode                       :  1; /**<bit[10 : 10] */
		uint32_t en_out_test1v                    :  1; /**<bit[11 : 11] */
		uint32_t nc_12_12                         :  1; /**<bit[12 : 12] */
		uint32_t sel_seri_cap                     :  1; /**<bit[13 : 13] */
		uint32_t en_seri_cap                      :  1; /**<bit[14 : 14] */
		uint32_t cal_ctrl                         :  2; /**<bit[15 : 16] */
		uint32_t cal_vth                          :  3; /**<bit[17 : 19] */
		uint32_t crg                              :  2; /**<bit[20 : 21] */
		uint32_t vrefs                            :  4; /**<bit[22 : 25] */
		uint32_t gain_s                           :  4; /**<bit[26 : 29] */
		uint32_t td_latch1v                       :  1; /**<bit[30 : 30] */
		uint32_t pwd_td                           :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg14_t;


typedef volatile union {
	struct {
		uint32_t test_number1v                    :  4; /**<bit[0 : 3] */
		uint32_t test_period1v                    :  4; /**<bit[4 : 7] */
		uint32_t chs                              : 16; /**<bit[8 : 23] */
		uint32_t chs_sel_cal1v                    :  4; /**<bit[24 : 27] */
		uint32_t cal_done_clr1v                   :  1; /**<bit[28 : 28] */
		uint32_t en_cal_force1v                   :  1; /**<bit[29 : 29] */
		uint32_t en_cal_auto1v                    :  1; /**<bit[30 : 30] */
		uint32_t en_scan                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg15_t;


typedef volatile union {
	struct {
		uint32_t int_en                           : 16; /**<bit[0 : 15] */
		uint32_t int_en16                         :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t nc_18_18                         :  1; /**<bit[18 : 18] */
		uint32_t cal_number1v                     :  4; /**<bit[19 : 22] */
		uint32_t cal_period1v                     :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg16_t;


typedef volatile union {
	struct {
		uint32_t int_clr                          : 16; /**<bit[0 : 15] */
		uint32_t int_clr16                          :  1; /**<bit[16 : 16] */
		uint32_t ck_adc_sel                       :  1; /**<bit[17 : 17] */
		uint32_t int_clr_sel                      :  1; /**<bit[18 : 18] */
		uint32_t en_lpmod                         :  1; /**<bit[19 : 19] */
		uint32_t en_testcmp1v                     :  1; /**<bit[20 : 20] */
		uint32_t en_man_wr1v                      :  1; /**<bit[21 : 21] */
		uint32_t en_manmod1v                      :  1; /**<bit[22 : 22] */
		uint32_t cap_calspi1v                     :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg17_t;


typedef volatile union {
	struct {
		uint32_t iselaud                          :  1; /**<bit[0 : 0] */
		uint32_t audck_rlcen1v                    :  1; /**<bit[1 : 1] */
		uint32_t lchckinven1v                     :  1; /**<bit[2 : 2] */
		uint32_t enaudbias                        :  1; /**<bit[3 : 3] */
		uint32_t enadcbias                        :  1; /**<bit[4 : 4] */
		uint32_t enmicbias                        :  1; /**<bit[5 : 5] */
		uint32_t adcckinven1v                     :  1; /**<bit[6 : 6] */
		uint32_t dacfb2st0v9                      :  1; /**<bit[7 : 7] */
		uint32_t nc_8_8                           :  1; /**<bit[8 : 8] */
		uint32_t micbias_trm                      :  2; /**<bit[9 : 10] */
		uint32_t micbias_voc                      :  5; /**<bit[11 : 15] */
		uint32_t vrefsel1v                        :  1; /**<bit[16 : 16] */
		uint32_t capswspi                         :  5; /**<bit[17 : 21] */
		uint32_t adref_sel                        :  2; /**<bit[22 : 23] */
		uint32_t nc_24_29                         :  6; /**<bit[24 : 29] */
		uint32_t lchck_sel                        :  1; /**<bit[30 : 30] */
		uint32_t spi_dacckpssel                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg18_t;


typedef volatile union {
	struct {
		uint32_t isel                             :  2; /**<bit[0 : 1] */
		uint32_t micirsel1                        :  1; /**<bit[2 : 2] */
		uint32_t micdacit                         :  2; /**<bit[3 : 4] */
		uint32_t micdacih                         :  8; /**<bit[5 : 12] */
		uint32_t micsingleen                      :  1; /**<bit[13 : 13] */
		uint32_t dccompen                         :  1; /**<bit[14 : 14] */
		uint32_t micgain                          :  4; /**<bit[15 : 18] */
		uint32_t micdacen                         :  1; /**<bit[19 : 19] */
		uint32_t stg2lsen1v                       :  1; /**<bit[20 : 20] */
		uint32_t openloopcal1v                    :  1; /**<bit[21 : 21] */
		uint32_t callatch                         :  1; /**<bit[22 : 22] */
		uint32_t vcmsel                           :  1; /**<bit[23 : 23] */
		uint32_t dwamode                          :  1; /**<bit[24 : 24] */
		uint32_t r2ren                            :  1; /**<bit[25 : 25] */
		uint32_t nc_26_27                         :  2; /**<bit[26 : 27] */
		uint32_t micen                            :  1; /**<bit[28 : 28] */
		uint32_t rst                              :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v                          :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg                         :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg19_t;


typedef volatile union {
	struct {
		uint32_t hpdac                            :  1; /**<bit[0 : 0] */
		uint32_t calcon_sel                       :  1; /**<bit[1 : 1] */
		uint32_t oscdac                           :  2; /**<bit[2 : 3] */
		uint32_t ocendac                          :  1; /**<bit[4 : 4] */
		uint32_t vcmsel                           :  1; /**<bit[5 : 5] */
		uint32_t adjdacref                        :  5; /**<bit[6 : 10] */
		uint32_t dcochg                           :  2; /**<bit[11 : 12] */
		uint32_t diffen                           :  1; /**<bit[13 : 13] */
		uint32_t endaccal                         :  1; /**<bit[14 : 14] */
		uint32_t nc_15_15                         :  1; /**<bit[15 : 15] */
		uint32_t lendcoc                          :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t lenvcmd                          :  1; /**<bit[18 : 18] */
		uint32_t dacdrven                         :  1; /**<bit[19 : 19] */
		uint32_t nc_20_20                         :  1; /**<bit[20 : 20] */
		uint32_t daclen                           :  1; /**<bit[21 : 21] */
		uint32_t dacg                             :  4; /**<bit[22 : 25] */
		uint32_t dacmute                          :  1; /**<bit[26 : 26] */
		uint32_t dacdwamode_sel                   :  1; /**<bit[27 : 27] */
		uint32_t dacsel                           :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_ana_reg20_t;


typedef volatile union {
	struct {
		uint32_t lmdcin                           :  8; /**<bit[0 : 7] */
		uint32_t nc_8_15                          :  8; /**<bit[8 : 15] */
		uint32_t spirst_ovc                       :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t enidacl                          :  1; /**<bit[18 : 18] */
		uint32_t dac3rdhc0v9                      :  1; /**<bit[19 : 19] */
		uint32_t hc2s                             :  1; /**<bit[20 : 20] */
		uint32_t rfb_ctrl                         :  1; /**<bit[21 : 21] */
		uint32_t vcmsel                           :  1; /**<bit[22 : 22] */
		uint32_t enbs                             :  1; /**<bit[23 : 23] */
		uint32_t calck_sel0v9                     :  1; /**<bit[24 : 24] */
		uint32_t bpdwa0v9                         :  1; /**<bit[25 : 25] */
		uint32_t looprst0v9                       :  1; /**<bit[26 : 26] */
		uint32_t oct0v9                           :  2; /**<bit[27 : 28] */
		uint32_t sout0v9                          :  1; /**<bit[29 : 29] */
		uint32_t hc0v9                            :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_ana_reg21_t;


typedef volatile union {
	struct {
		uint32_t nc_0_0                   :  1; /**<bit[0 : 0] */
		uint32_t lvref                    :  2; /**<bit[1 : 2] */
		uint32_t hvref                    :  2; /**<bit[3 : 4] */
		uint32_t bandm                    :  7; /**<bit[5 : 11] */
		uint32_t nc_12_23                 : 12; /**<bit[12 : 23] */
		uint32_t n_int                    :  6; /**<bit[24 : 29] */
		uint32_t nc_30_30                 :  1; /**<bit[30 : 30] */
		uint32_t errdet_en                :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg22_t;


typedef volatile union {
	struct {
		uint32_t int_mod                  :  1; /**<bit[0 : 0] */
		uint32_t nsyn                     :  1; /**<bit[1 : 1] */
		uint32_t open_enb                 :  1; /**<bit[2 : 2] */
		uint32_t reset                    :  1; /**<bit[3 : 3] */
		uint32_t ioffset                  :  3; /**<bit[4 : 6] */
		uint32_t lpfrz                    :  4; /**<bit[7 : 10] */
		uint32_t vsel                     :  1; /**<bit[11 : 11] */
		uint32_t nc_12_14                 :  3; /**<bit[12 : 14] */
		uint32_t pwd_lockdet              :  1; /**<bit[15 : 15] */
		uint32_t nc_16_17                 :  2; /**<bit[16 : 17] */
		uint32_t spi_trigger              :  1; /**<bit[18 : 18] */
		uint32_t manual                   :  1; /**<bit[19 : 19] */
		uint32_t test_en                  :  1; /**<bit[20 : 20] */
		uint32_t nc_21_22                 :  2; /**<bit[21 : 22] */
		uint32_t icp                      :  2; /**<bit[23 : 24] */
		uint32_t nc_25_27                 :  3; /**<bit[25 : 27] */
		uint32_t errdet_spien             :  1; /**<bit[28 : 28] */
		uint32_t dlysel                   :  2; /**<bit[29 : 30] */
		uint32_t audioen                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg23_t;


typedef volatile union {
	struct {
		uint32_t int_clr_cal              : 16; /**<bit[0 : 15] */
		uint32_t int_en_cal               : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} sys_ana_reg24_t;


typedef volatile union {
	struct {
		uint32_t int_mod                  :  1; /**<bit[0 : 0] */
		uint32_t nsyn                     :  1; /**<bit[1 : 1] */
		uint32_t open_enb                 :  1; /**<bit[2 : 2] */
		uint32_t reset                    :  1; /**<bit[3 : 3] */
		uint32_t ioffsetl                 :  3; /**<bit[4 : 6] */
		uint32_t lpfrz                    :  4; /**<bit[7 : 10] */
		uint32_t vsel                     :  3; /**<bit[11 : 13] */
		uint32_t vsel_cal                 :  1; /**<bit[14 : 14] */
		uint32_t pwd_lockdet              :  1; /**<bit[15 : 15] */
		uint32_t lockdet_bypass           :  1; /**<bit[16 : 16] */
		uint32_t ckref_loop_sel           :  1; /**<bit[17 : 17] */
		uint32_t spi_trigger              :  1; /**<bit[18 : 18] */
		uint32_t manual                   :  1; /**<bit[19 : 19] */
		uint32_t test_ckaudio_en          :  1; /**<bit[20 : 20] */
		uint32_t ck2xen                   :  1; /**<bit[21 : 21] */
		uint32_t icp                      :  2; /**<bit[22 : 23] */
		uint32_t cktst_sel                :  1; /**<bit[24 : 24] */
		uint32_t edgesel_nck              :  1; /**<bit[25 : 25] */
		uint32_t nloaddlyen               :  1; /**<bit[26 : 26] */
		uint32_t bypass_caldone_auto      :  1; /**<bit[27 : 27] */
		uint32_t cal_res_spi              :  3; /**<bit[28 : 30] */
		uint32_t audioen                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg25_t;


typedef volatile union {
	struct {
		uint32_t n                        : 30; /**<bit[0 : 29] */
		uint32_t calres_spien             :  1; /**<bit[30 : 30] */
		uint32_t calrefen                 :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg26_t;


typedef volatile union {
	struct {
		uint32_t isel                     :  2; /**<bit[0 : 1] */
		uint32_t micirsel1                :  1; /**<bit[2 : 2] */
		uint32_t micdacit                 :  2; /**<bit[3 : 4] */
		uint32_t micdacih                 :  8; /**<bit[5 : 12] */
		uint32_t micsingleen              :  1; /**<bit[13 : 13] */
		uint32_t dccompen                 :  1; /**<bit[14 : 14] */
		uint32_t micgain                  :  4; /**<bit[15 : 18] */
		uint32_t micdacen                 :  1; /**<bit[19 : 19] */
		uint32_t stg2lsen1v               :  1; /**<bit[20 : 20] */
		uint32_t openloopcal1v            :  1; /**<bit[21 : 21] */
		uint32_t callatch                 :  1; /**<bit[22 : 22] */
		uint32_t vcmsel                   :  1; /**<bit[23 : 23] */
		uint32_t dwamode                  :  1; /**<bit[24 : 24] */
		uint32_t r2ren                    :  1; /**<bit[25 : 25] */
		uint32_t nc_26_27                 :  2; /**<bit[26 : 27] */
		uint32_t micen                    :  1; /**<bit[28 : 28] */
		uint32_t rst                      :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v                  :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg                 :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg27_t;

