tuya/tuyaopen-platform-t5ai/t5_os/cp/middleware/soc/bk7257/soc/sys_struct.h
typedef volatile struct {
	volatile sys_device_id_t device_id;
	volatile sys_version_id_t version_id;
	volatile sys_cpu_current_run_status_t cpu_current_run_status;
	volatile sys_cpu_storage_connect_op_select_t cpu_storage_connect_op_select;
	volatile sys_cpu0_int_halt_clk_op_t cpu0_int_halt_clk_op;
	volatile sys_cpu1_int_halt_clk_op_t cpu1_int_halt_clk_op;
	volatile sys_cpu2_int_halt_clk_op_t cpu2_int_halt_clk_op;
	volatile sys_reserved_reg0x7_t reserved_reg0x7;
	volatile sys_cpu_clk_div_mode1_t cpu_clk_div_mode1;
	volatile sys_cpu_clk_div_mode2_t cpu_clk_div_mode2;
	volatile sys_cpu_26m_wdt_clk_div_t cpu_26m_wdt_clk_div;
	volatile sys_cpu_anaspi_freq_t cpu_anaspi_freq;
	volatile sys_cpu_device_clk_enable_t cpu_device_clk_enable;
	volatile sys_reserver_reg0xd_t reserver_reg0xd;
	volatile sys_cpu_device_mem_ctrl1_t cpu_device_mem_ctrl1;
	volatile sys_cpu_device_mem_ctrl2_t cpu_device_mem_ctrl2;
	volatile sys_cpu_power_sleep_wakeup_t cpu_power_sleep_wakeup;
	volatile sys_cpu0_lv_sleep_cfg_t cpu0_lv_sleep_cfg;
	volatile sys_cpu_device_mem_ctrl3_t cpu_device_mem_ctrl3;
	volatile uint32_t rsv_13_1f[13];
	volatile sys_cpu0_int_0_31_en_t cpu0_int_0_31_en;
	volatile sys_cpu0_int_32_63_en_t cpu0_int_32_63_en;
	volatile sys_cpu1_int_0_31_en_t cpu1_int_0_31_en;
	volatile sys_cpu1_int_32_63_en_t cpu1_int_32_63_en;
	volatile sys_cpu2_int_0_31_en_t cpu2_int_0_31_en;
	volatile sys_cpu2_int_32_63_en_t cpu2_int_32_63_en;
	volatile uint32_t rsv_26_27[2];
	volatile sys_cpu0_int_0_31_status_t cpu0_int_0_31_status;
	volatile sys_cpu0_int_32_63_status_t cpu0_int_32_63_status;
	volatile sys_cpu1_int_0_31_status_t cpu1_int_0_31_status;
	volatile sys_cpu1_int_32_63_status_t cpu1_int_32_63_status;
	volatile sys_cpu2_int_0_31_status_t cpu2_int_0_31_status;
	volatile sys_cpu2_int_32_63_status_t cpu2_int_32_63_status;
	volatile uint32_t rsv_2e_2f[2];
	volatile sys_gpio_config0_t gpio_config0;
	volatile sys_gpio_config1_t gpio_config1;
	volatile sys_gpio_config2_t gpio_config2;
	volatile sys_gpio_config3_t gpio_config3;
	volatile sys_gpio_config4_t gpio_config4;
	volatile sys_gpio_config5_t gpio_config5;
	volatile sys_gpio_config6_t gpio_config6;
	volatile uint32_t rsv_37_37[1];
	volatile sys_sys_debug_config0_t sys_debug_config0;
	volatile sys_sys_debug_config1_t sys_debug_config1;
	volatile sys_anareg_stat_t anareg_stat;

	/* address gap/reserve*/
	volatile uint32_t rsv_3a_3f[5];

	/* analog registers*/
	volatile sys_ana_reg0_t ana_reg0;
	volatile sys_ana_reg1_t ana_reg1;
	volatile sys_ana_reg2_t ana_reg2;
	volatile sys_ana_reg3_t ana_reg3;
	volatile sys_ana_reg4_t ana_reg4;
	volatile sys_ana_reg5_t ana_reg5;
	volatile sys_ana_reg6_t ana_reg6;
	volatile sys_ana_reg7_t ana_reg7;
	volatile sys_ana_reg8_t ana_reg8;
	volatile sys_ana_reg9_t ana_reg9;
	volatile sys_ana_reg10_t ana_reg10;
	volatile sys_ana_reg11_t ana_reg11;
	volatile sys_ana_reg12_t ana_reg12;
	volatile sys_ana_reg13_t ana_reg13;
	volatile sys_ana_reg14_t ana_reg14;
	volatile sys_ana_reg15_t ana_reg15;
	volatile sys_ana_reg16_t ana_reg16;
	volatile sys_ana_reg17_t ana_reg17;
	volatile sys_ana_reg18_t ana_reg18;
	volatile sys_ana_reg19_t ana_reg19;
	volatile sys_ana_reg20_t ana_reg20;
	volatile sys_ana_reg21_t ana_reg21;
	volatile sys_ana_reg22_t ana_reg22;
	volatile sys_ana_reg23_t ana_reg23;
	volatile sys_ana_reg24_t ana_reg24;
	volatile sys_ana_reg25_t ana_reg25;
	volatile sys_ana_reg26_t ana_reg26;
	volatile sys_ana_reg27_t ana_reg27;
} sys_hw_t;

#ifdef __cplusplus
}
#endif
